mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
	if (!mLcd) {
		mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
		mLcd->init (title, buffered);
		}

	return mLcd;
	}
//}}}
//{{{
std::string cLcd::hex (int value, uint8_t width) {

	std::ostringstream os;
	if (width)
		os << std::hex << std::setfill ('0') << std::setw (width) << value;
	else
		os << std::hex << value;
	return os.str();
	}
//}}}
//{{{
std::string cLcd::dec (int value, uint8_t width, char fill) {

	std::ostringstream os;
	if (width)
		os << std::setfill (fill) << std::setw (width) << value;
	else
		os << value;
	return os.str();
	}
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
	mTitle = title;
	updateNumDrawLines();
	}
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

	mShowTitle = title;
	mShowInfo = info;
	mShowLcdStats = lcdStats;
	mShowFooter = footer;

	updateNumDrawLines();
	}
//}}}

//{{{
void cLcd::info (uint32_t colour, std::string str, bool newLine) {

	bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

	auto line = (newLine && (mLastLine < mMaxLine-1)) ? mLastLine+1 : mLastLine;
	mLines[line].mTime = osKernelSysTick();
	mLines[line].mColour = colour;
	mLines[line].mString = str;
	if (newLine)
		mLastLine = line;

	if (tailing)
		mFirstLine = mLastLine - mNumDrawLines + 1;
	}
//}}}
//{{{
void cLcd::info (std::string str, bool newLine) {
	info (COL_WHITE, str, newLine);
	}
//}}}

//{{{
void cLcd::press (int pressCount, int x, int y, int z, int xinc, int yinc) {

	if ((pressCount > 30) && (x <= mStringPos) && (y <= getLineHeight()))
		reset();
	else if (pressCount == 0) {
		if (x <= mStringPos) {
			// set displayFirstLine
			if (y < 2 * getLineHeight())
				displayTop();
			else if (y > getHeight() - 2 * getLineHeight())
				displayTail();
			}
		}
	else {
		// inc firstLine
		float value = mFirstLine - ((2.0f * yinc) / getLineHeight());

		if (value < 0)
			mFirstLine = 0;
		else if (mLastLine <= (int)mNumDrawLines-1)
			mFirstLine = 0;
		else if (value > mLastLine - mNumDrawLines + 1)
			mFirstLine = mLastLine - mNumDrawLines + 1;
		else
			mFirstLine = value;
		}
	}
//}}}

//{{{
void cLcd::startRender() {

	if (mBuffered) {
		mDrawBuffer = !mDrawBuffer;
		setLayer (0, mBuffer[mDrawBuffer]);

		// frameSync;
		ltdc.frameWait = 1;
		if (osSemaphoreWait (ltdc.sem, 100) != osOK)
			ltdc.timeouts++;
		}

	mDrawStartTime = osKernelSysTick();
	}
//}}}
//{{{
void cLcd::render() {

	if (!mBuffered) {
		mDrawStartTime = osKernelSysTick();
		clear (COL_BLACK);
		endDraw();
		}
	}
//}}}
//{{{
void cLcd::renderCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
	ellipse (colour, x, y, z, z);
	}
//}}}
//{{{
void cLcd::endRender() {

	auto y = 0;
	if (mShowTitle && !mTitle.empty()) {
		//{{{  draw title
		text (COL_WHITE, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
		y += getLineHeight();
		}
		//}}}
	if (mShowInfo) {
		//{{{  draw info lines
		if (mLastLine >= 0) {
			// draw scroll bar
			auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
			auto height = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
			rectClipped (COL_YELLOW, 0, yorg, 8, height);
			}

		auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
		if (lastLine > mLastLine)
			lastLine = mLastLine;
		for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
			auto x = 0;
			auto xinc = text (COL_GREEN, getFontHeight(),
												dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
												dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
			x += xinc + 3;
			text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
			y += getLineHeight();
			}
		}
		//}}}
	if (mShowLcdStats) {
		//{{{  draw lcdStats
		std::string str = dec (ltdc.lineIrq) + ":f " +
									dec (ltdc.lineTicks) + "ms " +
											dec (mDma2dHighWater-mDma2dBuf) + ":hi " +
											dec (mDma2dTimeouts) + " " +
											dec (ltdc.transferErrorIrq) + " " +
											dec (ltdc.fifoUnderunIrq);
		text (COL_WHITE, getFontHeight(), str, 0, getHeight() - 2 * getLineHeight(), getWidth(), 24);
		}
		//}}}
	if (mShowFooter)
		//{{{  draw footer
		text (COL_YELLOW, getFontHeight(),
					dec (xPortGetFreeHeapSize()) + " " + dec (osGetCPUUsage()) + "% " + dec (mDrawTime) + "ms",
					0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
		//}}}

	sendWait();
	showLayer (0, mBuffer[mDrawBuffer], 255);

	mDrawTime = osKernelSysTick() - mDrawStartTime;
	}
//}}}

//{{{
void cLcd::displayOn() {

	// enable LTDC
	LTDC->GCR |= LTDC_GCR_LTDCEN;

	// turn on DISP pin
	HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);        /* Assert LCD_DISP pin */

	// turn on backlight
	HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);  /* Assert LCD_BL_CTRL pin */
	}
//}}}
//{{{
void cLcd::displayOff() {

	// disable LTDC
	LTDC->GCR &= ~LTDC_GCR_LTDCEN;

	// turn off DISP pin
	HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET);      /* De-assert LCD_DISP pin */

	// turn off backlight
	HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);/* De-assert LCD_BL_CTRL pin */
	}
//}}}

// iDraw
//{{{
int cLcd::text (uint32_t colour, int fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

	for (unsigned int i = 0; i < str.size(); i++) {
		if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
			auto fontChar = chars[str[i] - 0x20];
			if (!fontChar) {
				FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
				FT_Load_Char (FTface, str[i], FT_LOAD_RENDER);

				// cache char info
				fontChar = (tFontChar*)pvPortMalloc (sizeof(tFontChar));
				chars[str[i] - 0x20] = fontChar;
				fontChar->left = FTglyphSlot->bitmap_left;
				fontChar->top = FTglyphSlot->bitmap_top;
				fontChar->pitch = FTglyphSlot->bitmap.pitch;
				fontChar->rows = FTglyphSlot->bitmap.rows;
				fontChar->advance = FTglyphSlot->advance.x / 64;
				fontChar->bitmap = nullptr;

