mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
				if (FTglyphSlot->bitmap.buffer) {
					// cache char bitmap
					fontChar->bitmap = (uint8_t*)pvPortMalloc (FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
					memcpy (fontChar->bitmap, FTglyphSlot->bitmap.buffer, FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
					}
				}

			if (x + fontChar->left + fontChar->pitch >= width)
				break;
			else if (fontChar->bitmap)
				stampClipped (colour, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

			x += fontChar->advance;
			}
		}

	return x;
	}
//}}}
//{{{
void cLcd::pixel (uint32_t colour, int16_t x, int16_t y) {

	if (mBuffered)
		rect (colour, x, y, 1, 1);
	else
		*(uint32_t*)(curFrameBufferAddress + (y*getWidth() + x)*4) = colour;
	}
//}}}
//{{{
void cLcd::stamp (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

	if (mBuffered) {
		*mDma2dCurBuf++ = colour;                                             // colour
		*mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // bgnd fb start address
		*mDma2dCurBuf++ = getWidth() - width;                                 // stride
		*mDma2dCurBuf++ = (width << 16) | height;                             // width:height
		*mDma2dCurBuf++ = (uint32_t)src;                                      // src start address
		*mDma2dCurBuf++ = 0;                                                  // terminate
		*(mDma2dCurBuf-7) = kStamp;                                           // stamp opCode

		if (mDma2dCurBuf > mDma2dHighWater)
			mDma2dHighWater = mDma2dCurBuf;
		}

	else {
		DMA2D->FGCOLR = colour;
		DMA2D->OMAR   = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
		DMA2D->BGMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
		DMA2D->OOR    = getWidth() - width;
		DMA2D->BGOR   = getWidth() - width;
		DMA2D->NLR    = (width << 16) | height;
		DMA2D->FGMAR  = (uint32_t)src;
		DMA2D->CR = DMA2D_CR_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
		while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
		DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
									 DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
		}
	}
//}}}
//{{{
void cLcd::rect (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

	if (mBuffered) {
		*mDma2dCurBuf++ = colour;                                             // colour
		*mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // fb start address
		*mDma2dCurBuf++ = getWidth() - width;                                 // stride
		*mDma2dCurBuf++ = (width << 16) | height;                             // width:height
		*mDma2dCurBuf++ = 0;                                                  // terminate
		*(mDma2dCurBuf-6) = kWipe;                                            // fill opCode

		if (mDma2dCurBuf > mDma2dHighWater)
			mDma2dHighWater = mDma2dCurBuf;
		}

	else {
		DMA2D->OCOLR = colour;
		DMA2D->OMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
		DMA2D->OOR   = getWidth() - width;
		DMA2D->NLR   = (width << 16) | height;
		DMA2D->CR = DMA2D_CR_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
		while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
		DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
									 DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
		}

	}
//}}}

//{{{
void cLcd::pixelClipped (uint32_t colour, int16_t x, int16_t y) {

		rectClipped (colour, x, y, 1, 1);
	}
//}}}
//{{{
void cLcd::stampClipped (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

	if (!width || !height || x < 0)
		return;

	if (y < 0) {
		// top clip
		if (y + height <= 0)
			return;
		height += y;
		src += -y * width;
		y = 0;
		}

	if (y + height > getHeight()) {
		// bottom yclip
		if (y >= getHeight())
			return;
		height = getHeight() - y;
		}

	stamp (colour, src, x, y, width, height);
	}
//}}}
//{{{
void cLcd::rectClipped (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

	if (x >= getWidth())
		return;
	if (y >= getHeight())
		return;

	int xend = x + width;
	if (xend <= 0)
		return;

	int yend = y + height;
	if (yend <= 0)
		return;

	if (x < 0)
		x = 0;
	if (xend > getWidth())
		xend = getWidth();

	if (y < 0)
		y = 0;
	if (yend > getHeight())
		yend = getHeight();

	if (!width)
		return;
	if (!height)
		return;

	rect (colour, x, y, xend - x, yend - y);
	}
//}}}
//{{{
void cLcd::rectOutline (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height, uint8_t thickness) {

	rectClipped (colour, x, y, width, thickness);
	rectClipped (colour, x + width - thickness, y, thickness, height);
	rectClipped (colour, x, y + height - thickness, width, thickness);
	rectClipped (colour, x, y, thickness, height);
	}
//}}}
//{{{
void cLcd::clear (uint32_t colour) {

	rect (colour, 0, 0, getWidth(), getHeight());
	}
//}}}
//{{{
void cLcd::ellipse (uint32_t colour, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

	if (!xradius)
		return;
	if (!yradius)
		return;

	int x1 = 0;
	int y1 = -yradius;
	int err = 2 - 2*xradius;
	float k = (float)yradius / xradius;

	do {
		rectClipped (colour, (x-(uint16_t)(x1 / k)), y + y1, (2*(uint16_t)(x1 / k) + 1), 1);
		rectClipped (colour, (x-(uint16_t)(x1 / k)), y - y1, (2*(uint16_t)(x1 / k) + 1), 1);

		int e2 = err;
		if (e2 <= x1) {
			err += ++x1 * 2 + 1;
			if (-y1 == x && e2 <= y1)
				e2 = 0;
			}
		if (e2 > y1)
			err += ++y1*2 + 1;
		} while (y1 <= 0);
	}
//}}}
//{{{
void cLcd::ellipseOutline (uint32_t colour, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

	if (xradius && yradius) {
		int x1 = 0;
		int y1 = -yradius;
		int err = 2 - 2*xradius;
		float k = (float)yradius / xradius;

		do {
			rectClipped (colour, x - (uint16_t)(x1 / k), y + y1, 1, 1);
			rectClipped (colour, x + (uint16_t)(x1 / k), y + y1, 1, 1);
			rectClipped (colour, x + (uint16_t)(x1 / k), y - y1, 1, 1);
			rectClipped (colour, x - (uint16_t)(x1 / k), y - y1, 1, 1);

