mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
			int e2 = err;
			if (e2 <= x1) {
				err += ++x1*2 + 1;
				if (-y1 == x1 && e2 <= y1)
					e2 = 0;
				}
			if (e2 > y1)
				err += ++y1*2 + 1;
			} while (y1 <= 0);
		}
	}
//}}}
//{{{
void cLcd::line (uint32_t colour, int16_t x1, int16_t y1, int16_t x2, int16_t y2) {

	int16_t deltax = ABS(x2 - x1);        /* The difference between the x's */
	int16_t deltay = ABS(y2 - y1);        /* The difference between the y's */
	int16_t x = x1;                       /* Start x off at the first pixel */
	int16_t y = y1;                       /* Start y off at the first pixel */

	int16_t xinc1;
	int16_t xinc2;
	if (x2 >= x1) {               /* The x-values are increasing */
		xinc1 = 1;
		xinc2 = 1;
		}
	else {                         /* The x-values are decreasing */
		xinc1 = -1;
		xinc2 = -1;
		}

	int yinc1;
	int yinc2;
	if (y2 >= y1) {                 /* The y-values are increasing */
		yinc1 = 1;
		yinc2 = 1;
		}
	else {                         /* The y-values are decreasing */
		yinc1 = -1;
		yinc2 = -1;
		}

	int den = 0;
	int num = 0;
	int num_add = 0;
	int num_pixels = 0;
	if (deltax >= deltay) {        /* There is at least one x-value for every y-value */
		xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
		yinc2 = 0;                  /* Don't change the y for every iteration */
		den = deltax;
		num = deltax / 2;
		num_add = deltay;
		num_pixels = deltax;         /* There are more x-values than y-values */
		}
	else {                         /* There is at least one y-value for every x-value */
		xinc2 = 0;                  /* Don't change the x for every iteration */
		yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
		den = deltay;
		num = deltay / 2;
		num_add = deltax;
		num_pixels = deltay;         /* There are more y-values than x-values */
	}

	for (int curpixel = 0; curpixel <= num_pixels; curpixel++) {
		rectClipped (colour, x, y, 1, 1);   /* Draw the current pixel */
		num += num_add;                            /* Increase the numerator by the top of the fraction */
		if (num >= den) {                          /* Check if numerator >= denominator */
			num -= den;                             /* Calculate the new numerator value */
			x += xinc1;                             /* Change the x as appropriate */
			y += yinc1;                             /* Change the y as appropriate */
			}
		x += xinc2;                               /* Change the x as appropriate */
		y += yinc2;                               /* Change the y as appropriate */
		}
	}
//}}}

// private
//{{{
void cLcd::init (std::string title, bool buffered) {

	mBuffered = buffered;
	mDrawBuffer = !mDrawBuffer;
	ltdcInit (mBuffer[mDrawBuffer]);

	//  dma2d init
	// unchanging dma2d regs
	DMA2D->OPFCCR  = DMA2D_ARGB8888; // bgnd fb ARGB
	DMA2D->BGPFCCR = DMA2D_ARGB8888;
	DMA2D->FGPFCCR = DMA2D_A8;       // src alpha
	DMA2D->FGOR    = 0;              // src stride
	//DMA2D->AMTCR = 0x1001;

	// zero out first opcode, point past it
	mDma2dBuf = (uint32_t*)DMA2D_BUFFER; // pvPortMalloc (8192 * 4);
	mDma2dCurBuf = mDma2dBuf;
	*mDma2dCurBuf++ = 0;
	mDma2dHighWater = mDma2dCurBuf;
	mDma2dIsrBuf = mDma2dBuf;
	mDma2dTimeouts = 0;

	if (mBuffered) {
		//{{{  dma2d IRQ init
		osSemaphoreDef (dma2dSem);
		mDma2dSem = osSemaphoreCreate (osSemaphore (dma2dSem), -1);

		HAL_NVIC_SetPriority (DMA2D_IRQn, 0x0F, 0);
		HAL_NVIC_EnableIRQ (DMA2D_IRQn);
		}
		//}}}

	clear (COL_BLACK);
	sendWait();
	displayOn();

	// font init
	setFont (freeSansBold, freeSansBold_len);
	for (auto i = 0; i < maxChars; i++)
		chars[i] = nullptr;

	setTitle (title);
	}
//}}}
//{{{
void cLcd::ltdcInit (uint32_t frameBufferAddress) {

	//{{{  LTDC, dma2d clock enable
	// enable the LTDC and DMA2D clocks
	__HAL_RCC_LTDC_CLK_ENABLE();
	__HAL_RCC_DMA2D_CLK_ENABLE();

	// enable GPIO clock, includes backlight, display enable
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOI_CLK_ENABLE();
	__HAL_RCC_GPIOJ_CLK_ENABLE();
	__HAL_RCC_GPIOK_CLK_ENABLE();
	//}}}
	//{{{  LTDC pin config
	// GPIOE config
	GPIO_InitTypeDef gpio_init_structure;
	gpio_init_structure.Pin       = GPIO_PIN_4;
	gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull      = GPIO_NOPULL;
	gpio_init_structure.Speed     = GPIO_SPEED_FAST;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init (GPIOE, &gpio_init_structure);

	// GPIOG config
	gpio_init_structure.Pin       = GPIO_PIN_12;
	gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF9_LTDC;
	HAL_GPIO_Init (GPIOG, &gpio_init_structure);

	// GPIOI LTDC alternate config
	gpio_init_structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
	gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init (GPIOI, &gpio_init_structure);

	// GPIOJ config
	gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
																	GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
																	GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
	gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init (GPIOJ, &gpio_init_structure);

	// GPIOK config
	gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
	gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init (GPIOK, &gpio_init_structure);

	// LCD_DISP GPIO config
	gpio_init_structure.Pin       = LCD_DISP_PIN;
	gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
	HAL_GPIO_Init (LCD_DISP_GPIO_PORT, &gpio_init_structure);

	// LCD_BL_CTRL GPIO config
	gpio_init_structure.Pin       = LCD_BL_CTRL_PIN;
	gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
	HAL_GPIO_Init (LCD_BL_CTRL_GPIO_PORT, &gpio_init_structure);
	//}}}
	//{{{  LTDC timing config
	#define RK043FN48H_WIDTH   480 // LCD PIXEL WIDTH
	#define RK043FN48H_HSYNC   41  // Horizontal synchronization
	#define RK043FN48H_HBP     13  // Horizontal back porch
	#define RK043FN48H_HFP     32  // Horizontal front porch

	#define RK043FN48H_HEIGHT  272 // LCD PIXEL HEIGHT
	#define RK043FN48H_VSYNC   10  // Vertical synchronization
	#define RK043FN48H_VBP     2   // Vertical back porch
	#define RK043FN48H_VFP     2   // Vertical front porch

	hLtdc.Init.HorizontalSync =     RK043FN48H_HSYNC - 1;
	hLtdc.Init.AccumulatedHBP =     RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
	hLtdc.Init.AccumulatedActiveW = RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
	hLtdc.Init.TotalWidth =         RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP + RK043FN48H_HFP - 1;

